1s/ERP/Conf/Documents/Лико_ЗаданиеНаОтборРазмещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаданиеНаОтборРазмещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПаллетыВСекциях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыСкладскихЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресТранзит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаданийСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриПодборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета2_0</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ФормированиеПаллета2_0</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресКудаФакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПеремещениеПаллета2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПаллетыВСекциях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПаллетыВСекциях</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СкладскиеСекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыЗаданийСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыЗаданийСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТранзите</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СкладскиеСекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СкладскиеСекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыСкладскихСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАдресов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Места</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Стеллажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Стеллажи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗонПриемкиОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСкладскихЯчеек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСекций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЯчеекВСекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПолный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШиринаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШиринаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинГлубинаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксГлубинаПаллета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Типоразмер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыСкладскихСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗоныПриемкиОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаданиеНаОтборРазмещение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс




/// <summary>
/// Создает документ "Лико_ЗаданиеНаОтборРазмещение" на основании других документов
/// </summary>
/// <param name="ДокументОснование">ДокументСсылка - Документ, на основании которого создается задание</param>
/// <param name="Паллет">СправочникСсылка.Лико_Паллеты2_0 - Паллет для отбора/размещения</param>
/// <param name="АдресОткуда">СправочникСсылка.СкладскиеЯчейки - Адрес откуда нужно отобрать товар</param>
/// <param name="АдресКуда">СправочникСсылка.СкладскиеЯчейки - Адрес куда нужно разместить товар</param>
/// <returns>DocumentRef.Лико_ЗаданиеНаОтборРазмещение - ссылка на созданный документ</returns>
Функция СоздатьЗадание(ДокументОснование, Паллет, АдресОткуда, АдресКуда) Экспорт
    	УстановитьПривилегированныйРежим(Истина);

	// Если паллет не заполнен, используем адрес откуда для поиска паллета
	Если Не ЗначениеЗаполнено(Паллет) Тогда
		Паллет = НайтиПаллетПоАдресу(АдресОткуда);
	КонецЕсли;

	// Если адрес куда не заполнен, используем функцию ПодобратьЯчейкуПоПаллету
	Если Не ЗначениеЗаполнено(АдресКуда) Тогда
		АдресКуда = Справочники.Лико_СкладскиеСекции.ПодобратьЯчейкуПоПаллету(АдресОткуда.Владелец, Паллет);
	КонецЕсли;


	// Создаем новый документ
	НовыйДокумент = СоздатьДокумент();

	// Заполняем документ согласно стандартам 1С
	НовыйДокумент.Заполнить(ДокументОснование);

	// Устанавливаем реквизиты
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.ДокументОснование = ДокументОснование;
	НовыйДокумент.Паллет = Паллет;
	НовыйДокумент.АдресОткуда = АдресОткуда;
	НовыйДокумент.АдресКуда = АдресКуда;
	  
	// Сохранение документа с обработкой ошибок
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении документа Лико_ЗаданиеНаОтборРазмещение: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;

	Возврат НовыйДокумент.Ссылка;

КонецФункции

Процедура ОбработатьЗадание(Ссылка)Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	
	СоздатьЗаданияПоЗаявке(Ссылка); 
	 СоздатьЗаданиеПоФормированию(Ссылка);
	 ИзменитьЗаданиеПоПеремещению(Ссылка);
	
КонецПроцедуры 

/// <summary>
/// Создает задания на отбор/размещение по документу Лико_ЗаявкаНаСклад
/// Группирует товары по адресам хранения, создает уникальные задания
/// Проверяет наличие паллетов в других заданиях и отменяет старые если необходимо
/// </summary>
/// <param name="ЗаявкаНаСклад">ДокументСсылка.Лико_ЗаявкаНаСклад - Заявка на склад</param>
Процедура СоздатьЗаданияПоЗаявке(ЗаявкаНаСклад) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ЗаявкаНаСклад)<>Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаСклад) Тогда
		ВызватьИсключение "Не заполнена заявка на склад";
	КонецЕсли;
	
	// Словарь для группировки адресов
	// Ключ - адрес хранения, Значение - массив паллетов
	АдресаПаллеты = Новый Соответствие;
	
	// Проходим по табличной части и группируем по адресам
	Для каждого СтрокаТовара Из ЗаявкаНаСклад.Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.АдресХранения) Тогда
			Продолжить;
		КонецЕсли;
		
		АдресХранения = СтрокаТовара.АдресХранения;
		Склад =  АдресХранения.Владелец;
		Если Не Склад.Лико_ИспользоватьЗаданияНаОтборРазмещение Тогда
			
			Продолжить;
			
		КонецЕсли;


		
		// Инициализируем массив для адреса если его еще нет
		Если АдресаПаллеты.Получить(АдресХранения) = Неопределено Тогда
			МассивПаллетов = Новый Массив;
			АдресаПаллеты.Вставить(АдресХранения, МассивПаллетов);
		Иначе
			МассивПаллетов = АдресаПаллеты.Получить(АдресХранения);
		КонецЕсли;
		
		// Находим паллет для этого адреса
		Паллет = НайтиПаллетПоАдресу(АдресХранения);
		
		// Добавляем паллет в массив если его там еще нет
		Если ЗначениеЗаполнено(Паллет) И МассивПаллетов.Найти(Паллет) = Неопределено Тогда
			МассивПаллетов.Добавить(Паллет);
			
			// Отменяем старые задания с этим паллетом если они существуют
			//ОтменитьСтарыеЗадания(Паллет);
		КонецЕсли;
	КонецЦикла;
	
	// Создаём задания для каждого адреса
	Для каждого ЭлементАдреса Из АдресаПаллеты Цикл
		
		АдресОткуда = ЭлементАдреса.Ключ;
		МассивПаллетов = ЭлементАдреса.Значение;
		
		// Для каждого паллета по этому адресу создаем задание
		Для каждого Паллет Из МассивПаллетов Цикл
			
			Документы.Лико_ЗаданиеНаОтборРазмещение.ОтменитьСтарыеЗадания(Паллет,Документы.Лико_ЗаданиеНаОтборРазмещение.ПустаяСсылка());

			
			// Подбираем адрес куда
			АдресКуда = Склад.Лико_ПолОтгрузкиГлавный;
			
			Если ЗначениеЗаполнено(АдресКуда) Тогда
				// Создаём документ задания
				СоздатьЗадание(ЗаявкаНаСклад, Паллет, АдресОткуда, АдресКуда);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

/// <summary>
/// Создает задание на отбор/размещение по документу Лико_ФормированиеПаллета2_0
/// На один документ формирования создается одно задание
/// </summary>
/// <param name="ФормированиеПаллета">ДокументСсылка.Лико_ФормированиеПаллета2_0 - Документ формирования паллета</param>
Процедура СоздатьЗаданиеПоФормированию(ФормированиеПаллета) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ФормированиеПаллета)<>Тип("ДокументСсылка.Лико_ФормированиеПаллета2_0") Тогда
		
		Возврат;
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(ФормированиеПаллета) Тогда
		ВызватьИсключение "Не заполнен документ формирования паллета";
	КонецЕсли;
	
	Если Не ФормированиеПаллета.АдресХранения.Владелец.Лико_ИспользоватьЗаданияНаОтборРазмещение Тогда
		
		Возврат;
		
	КонецЕсли;

	Если  Не ЗначениеЗаполнено(ФормированиеПаллета.Типоразмер) Тогда 
		Возврат;
	КонецЕсли;
	
	
	// Отменяем старые задания с этим паллетом если они существуют
	//ОтменитьСтарыеЗадания(ФормированиеПаллета.Паллет);
	
	// Подбираем адрес куда
	АдресКуда = Справочники.Лико_СкладскиеСекции.ПодобратьЯчейкуПоПаллету(
		ФормированиеПаллета.АдресХранения.Владелец, ФормированиеПаллета.Паллет,ФормированиеПаллета.Типоразмер);
	
	Если ЗначениеЗаполнено(АдресКуда) Тогда
		// Создаём документ задания
		СоздатьЗадание(ФормированиеПаллета, ФормированиеПаллета.Паллет, 
			ФормированиеПаллета.АдресХранения, АдресКуда);
		КонецЕсли; 
		
		
	
КонецПроцедуры

/// <summary>
/// Создает задание на отбор/размещение по документу Лико_ПеремещениеПаллета2_0
/// На один документ перемещения создается одно задание
/// </summary>
/// <param name="ПеремещениеПаллета">ДокументСсылка.Лико_ПеремещениеПаллета2_0 - Документ перемещения паллета</param>
Процедура ИзменитьЗаданиеПоПеремещению(ПеремещениеПаллета) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ПеремещениеПаллета)<>Тип("ДокументСсылка.Лико_ПеремещениеПаллета2_0") Тогда
		
		Возврат;
		
	КонецЕсли;

	
	Если Не ЗначениеЗаполнено(ПеремещениеПаллета) Тогда
		ВызватьИсключение "Не заполнен документ перемещения паллета";
	КонецЕсли;
	
	
	Задание=ПаллетВЗадании(ПеремещениеПаллета.Паллет);
	
	Если Не ЗначениеЗаполнено(Задание) Тогда
		   Возврат;
	КонецЕсли;
	
	ДокОбъект= Задание.ПолучитьОбъект(); 
	
	АдресХранения = ПеремещениеПаллета.АдресХранения;
	
	Если Не ДокОбъект.Склад.Лико_ИспользоватьЗаданияНаОтборРазмещение Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	Если ЭтоТранзитныйАдрес(АдресХранения) Тогда
		
		ДокОбъект.АдресТранзит=АдресХранения;
		
	Иначе
		
		ДокОбъект.АдресКудаФакт=АдресХранения;

		
	КонецЕсли;
	ДокОбъект.ДокументПеремещения=ПеремещениеПаллета;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении документа Лико_ЗаданиеНаОтборРазмещение: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;
	
		
КонецПроцедуры

Функция ЭтоТранзитныйАдрес(Адрес) //+Лико m.shenderov 06.04.2026
		УстановитьПривилегированныйРежим(Истина);

	Результат=Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СтеллажиЗоныПриемкиОтгрузки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_Стеллажи.ЗоныПриемкиОтгрузки КАК Лико_СтеллажиЗоныПриемкиОтгрузки
	|ГДЕ
	|	Лико_СтеллажиЗоныПриемкиОтгрузки.АдресХранения = &Адрес
	|	И НЕ Лико_СтеллажиЗоныПриемкиОтгрузки.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Результат = Истина;
	КонецЕсли;
	
	
Возврат Результат;	
	
КонецФункции //-Лико m.shenderov 06.04.2026 


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

/// <summary>
/// Функция поиска паллета по адресу хранения
/// </summary>
/// <param name="Адрес">СправочникСсылка.СкладскиеЯчейки - Адрес для поиска паллета</param>
/// <returns>СправочникСсылка.Лико_Паллеты2_0 - Найденный паллет</returns>
Функция НайтиПаллетПоАдресу(Адрес) Экспорт
 	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПаллетыВСекцияхОстатки.Паллет КАК Паллет
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(, Адрес = &Адрес) КАК Лико_ПаллетыВСекцияхОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Лико_ПаллетыВСекцияхОстатки.Паллет.Код";

	Запрос.УстановитьПараметр("Адрес", Адрес);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Паллет;
	Иначе
		Возврат Справочники.Лико_Паллеты2_0.ПустаяСсылка();
	КонецЕсли;

КонецФункции

/// <summary>
/// Проверяет наличие паллета в других заданиях на отбор/размещение
/// </summary>
/// <param name="Паллет">СправочникСсылка.Лико_Паллеты2_0 - Паллет для проверки</param>
/// <returns>Булево - Истина если паллет найден в других заданиях</returns>
Функция ПаллетВЗадании(Паллет) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Документы.Лико_ЗаданиеНаОтборРазмещение.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Паллет) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Задания.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаданиеНаОтборРазмещение КАК Задания
	|ГДЕ
	|	Задания.Паллет = &Паллет
	|	И Задания.Проведен = ИСТИНА
	|	И (Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.Новое)
	|			ИЛИ Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.ВТранзите))
	|	И НЕ Задания.ПометкаУдаления";

	Запрос.УстановитьПараметр("Паллет", Паллет);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	   Результат = Выборка.Ссылка;
   КонецЦикла; 
   
   Возврат Результат;
КонецФункции

/// <summary>
/// Отменяет старые задания с указанным паллетом
/// Отменяет только проведенные задания в статусе Новое или ВТранзите
/// </summary>
/// <param name="Паллет">СправочникСсылка.Лико_Паллеты2_0 - Паллет для отмены заданий</param>
Процедура ОтменитьСтарыеЗадания(Паллет, ЗаданиеСсылка=Неопределено) Экспорт
  	УстановитьПривилегированныйРежим(Истина);

	Если Не ЗначениеЗаполнено(Паллет) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задания.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаданиеНаОтборРазмещение КАК Задания
	|ГДЕ
	|	Задания.Паллет = &Паллет
	|	И Задания.Проведен = ИСТИНА
	|	И (Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.Новое)
	|			ИЛИ Задания.Статус = ЗНАЧЕНИЕ(Перечисление.Лико_СтатусыЗаданийСклада.ВТранзите))
	|	И НЕ Задания.ПометкаУдаления
	|	И Задания.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("Паллет", Паллет);
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеСсылка);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ОбъектЗадания = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектЗадания.Статус = Перечисления.Лико_СтатусыЗаданийСклада.Отменено;
		
		Попытка
			ОбъектЗадания.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		ОшибкаСообщение = "Ошибка при сохранении документа Лико_ЗаданиеНаОтборРазмещение: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вспомогательные процедуры и функции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
